app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "asdsd"], ["created_at", "2014-09-25 08:02:11.627574"], ["post_id", 1], ["updated_at", "2014-09-25 08:02:11.627574"]]
---
  def create
   @comment = Comment.new(comment_params)
   @comment.user_id=current_user
   @comment.save