app/controllers/home_controller.rb

  def index
     if user_signed_in?
     	#@posts = current_user.posts
     	redirect_to :controller => "posts", :action => "index"
     else
     	@posts = Post.all
     end
   @comments = Comment.all
   @user = User.all
---
SELECT "posts".* FROM "posts"
SELECT "comments".* FROM "comments"
SELECT "users".* FROM "users"