app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)


    respond_to do |format|
      if @post.save
        format.html { redirect_to @post, notice: 'Post was successfully created.' }
        format.json { render :show, status: :created, location: @post }
        a=Post.last
        a.user_id=current_user.id
        a.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Thes is text blog,Thes is text blog,Thes is text blog"], ["created_at", "2014-09-25 04:59:50.110116"], ["title", "Thes is text blog"], ["updated_at", "2014-09-25 04:59:50.110116"]]
SELECT  "posts".* FROM "posts"   ORDER BY "posts"."id" DESC LIMIT 1
UPDATE "posts" SET "updated_at" = ?, "user_id" = ? WHERE "posts"."id" = 10  [["updated_at", "2014-09-25 06:06:18.383681"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "body" = ?, "updated_at" = ?, "user_id" = ? WHERE "posts"."id" = 1  [["body", "Thes is text blog"], ["updated_at", "2014-09-25 10:53:00.288346"], ["user_id", nil]]